//=============================================================================
// 弾丸処理 [bullet.h]
// Author :
//=============================================================================
#pragma once
#include "WorldSpaceClass.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_BULLET		(256)				// 取り持ちの数(仮)
#define	BULLET_SIZE		(5.0f)				// 当たり判定の大きさ


//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct BULLET
{
	WorldSpace			object;

	float				spd;		// 移動スピード
	float				dir;		// 向き
	bool				use;

	// 階層アニメーション用のメンバー変数
	float				time;				// 線形補間用
	int					tblNo;				// 行動データのテーブル番号
	int					tblMax;				// そのテーブルのデータ数
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBullet(void);
void UninitBullet(void);
void UpdateBullet(void);
void DrawBullet(void);

BULLET* GetBullet(void);
float GetDistance3D(XMFLOAT3 pos1, XMFLOAT3 pos2);
