//=============================================================================
//
// ゲーム画面処理 [game.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
BOOL CollisionBC(XMFLOAT3 pos1, XMFLOAT3 pos2, XMFLOAT3 r1, XMFLOAT3 r2);

HRESULT InitGame(void);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);

