//=============================================================================
//
// リザルトテクスチャ処理 [title.h]
// Author : 岩田　輝
//
//=============================================================================
#pragma once
#include "WorldSpaceClass.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
class BUTTON : public WorldSpace
{
public:
	XMFLOAT3	pos;		//ポリゴンの座標
	float		w, h;		//幅と高さ
	float		alpha;		//透明度
	int			texNo;		//使用しているテクスチャ番号
	bool		flag_alpha;
	bool		flag_sound;
	bool		use;

};




//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitResultTex(void);
void UninitResultTex(void);
void UpdateResultTex(void);
void DrawResultTex(void);


